alibaba/AliOS-Things/platform/mcu/stm32f1xx/hal/hal_uart_stm32f1.c
/*
 * Copyright (C) 2015-2017 Alibaba Group Holding Limited
 */

#include <k_api.h>
#include <stdio.h>
#include <stdlib.h>
#include "hal/hal.h"
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_dma.h"

#include "hal_uart_stm32f1.h"


#ifdef HAL_UART_MODULE_ENABLED


/* function used to transform hal para to stm32l4 para */
static int32_t uart_dataWidth_transform(hal_uart_data_width_t data_width_hal, uint32_t *data_width_stm32l4);
static int32_t uart_parity_transform(hal_uart_parity_t parity_hal, uint32_t *parity_stm32l4);
static int32_t uart_stop_bits_transform(hal_uart_stop_bits_t stop_bits_hal, uint32_t *stop_bits_stm32l4);
static int32_t uart_flow_control_transform(hal_uart_flow_control_t flow_control_hal, uint32_t *flow_control_stm32l4);
static int32_t uart_mode_transform(hal_uart_mode_t mode_hal, uint32_t *mode_stm32l4);
static UART_HandleTypeDef * uart_get_handle(const uint8_t port);

/* function used to add buffer queue */
static PORT_UART_TYPE GetAppPortFromPhyInstanse(const void* uartIns);
//void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart);
//void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart);
static void UartIdleHandler( const USART_TypeDef* ins);
static int32_t uart_receive_start_it(PORT_UART_TYPE uart_port, uint32_t max_buffer_size);
static int32_t uart_receive_start_dma(PORT_UART_TYPE uart_port, uint32_t max_buffer_size);
static int32_t uart_send_it(PORT_UART_TYPE uart_port, const void *data, uint32_t size,uint32_t timeout);
static int32_t uart_send_dma(PORT_UART_TYPE uart_port, const void *data, uint32_t size,uint32_t timeout);
static int32_t uart_receive_it(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout);
static int32_t uart_receive_dma(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout);
static void UART_IT_RxCpltCallback(PORT_UART_TYPE appPort, uint32_t max_buffer_size);
static void UART_DMA_RxCpltCallback(PORT_UART_TYPE appPort, uint32_t max_buffer_size);

typedef struct {
    aos_mutex_t uart_tx_mutex;
    aos_mutex_t uart_rx_mutex;
    aos_sem_t uart_rx_sem;
    aos_sem_t uart_tx_sem;
    uint16_t  uart_rx_in;
    uint16_t  uart_rx_out;
    uint8_t   inited;
    UART_HandleTypeDef hal_uart_handle;
    char*      UartRxBuf;
    uint32_t   RxBuf_is_full;
    uint32_t  uart_error_count;
    uint32_t  uart_dma_stop;  //this bit is used only for error count now
    uint32_t  previous_dma_leftbyte;
}stm32_uart_t;

static stm32_uart_t stm32_uart[PORT_UART_SIZE];
uint32_t isrflags;

static void UartIRQProcessor(const USART_TypeDef* ins )
{
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(ins);
    uint32_t isrflags   = READ_REG(stm32_uart[appPort].hal_uart_handle.Instance->SR);
    uint32_t cr1its     = READ_REG(stm32_uart[appPort].hal_uart_handle.Instance->CR1);
    //deal with IDLE interrupt, HAL_UART_IRQHandler doesn't do it , we don't want to change HAL_UART_IRQHandler
    if(((isrflags & USART_SR_IDLE) != RESET) && ((cr1its & USART_CR1_IDLEIE) != RESET))
        UartIdleHandler(ins);

    if( appPort!=PORT_UART_INVALID ) {
        HAL_UART_IRQHandler(&stm32_uart[appPort].hal_uart_handle);  
    }

}

void USART_DMA_RX_IRQHandler(const void* uartIns)
{
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(uartIns);
    if( appPort!=PORT_UART_INVALID )
    {
        HAL_DMA_IRQHandler(stm32_uart[appPort].hal_uart_handle.hdmarx);
    }
}

void USART_DMA_TX_IRQHandler(const void* uartIns)
{
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(uartIns);
    if( appPort!=PORT_UART_INVALID )
    {
        HAL_DMA_IRQHandler(stm32_uart[appPort].hal_uart_handle.hdmatx);
    }
}


//Get UART Instanse & attribute from Logical Port
static UART_MAPPING* GetUARTMapping(const PORT_UART_TYPE port)
{
    int8_t i = 0;
    UART_MAPPING* rc = NULL;
    for(i=0; i<PORT_UART_SIZE; i++)
    {
        if(UART_MAPPING_TABLE[i].uartFuncP == port)
        {
            rc = &UART_MAPPING_TABLE[i];
            break;
        }
    }
    return rc;
}

static PORT_UART_TYPE GetAppPortFromPhyInstanse(const void* uartIns)
{
    PORT_UART_TYPE rc = PORT_UART_INVALID;
    int8_t i = 0;
    for(i; i<PORT_UART_SIZE; i++)
    {
        if( (USART_TypeDef*)UART_MAPPING_TABLE[i].uartPhyP == (USART_TypeDef*)uartIns)
        {
            rc = UART_MAPPING_TABLE[i].uartFuncP;
            break;
        }
    }
    return rc;
}

void USART1_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(USART1);
    krhino_intrpt_exit();
}

void USART2_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(USART2);
    krhino_intrpt_exit();
}

void USART3_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(USART3);
    krhino_intrpt_exit();
}

#ifdef UART4
void UART4_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(UART4); 
    krhino_intrpt_exit();
}
#endif

#ifdef UART5
void UART5_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(UART5);
    krhino_intrpt_exit();
}
#endif

#ifdef USART6
void USART6_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(USART6);
    krhino_intrpt_exit();
}
#endif

#ifdef UART7
void UART7_IRQHandler(void)
{
    krhino_intrpt_enter();
    UartIRQProcessor(UART7);
    krhino_intrpt_exit();
}
#endif
int32_t hal_uart_init(uart_dev_t *uart)
{
    int32_t ret = -1;
    UART_HandleTypeDef *pstuarthandle = NULL;
    UART_MAPPING* uartIns = NULL;
    
    if (uart == NULL) {
        return -1;
    }
    //no found this port in function-physical uartIns, no need initialization
    uartIns = GetUARTMapping(uart->port);
    if( NULL== uartIns ){ 
        return -1;
    }
    memset(&stm32_uart[uart->port],0,sizeof(stm32_uart_t));

    pstuarthandle = &stm32_uart[uart->port].hal_uart_handle;
    pstuarthandle->Init.BaudRate               = uart->config.baud_rate;
    ret = uart_dataWidth_transform(uart->config.data_width, &pstuarthandle->Init.WordLength);
    ret |= uart_parity_transform(uart->config.parity, &pstuarthandle->Init.Parity);
    ret |= uart_stop_bits_transform(uart->config.stop_bits, &pstuarthandle->Init.StopBits);
    ret |= uart_flow_control_transform(uart->config.flow_control, &pstuarthandle->Init.HwFlowCtl);
    ret |= uart_mode_transform(uart->config.mode, &pstuarthandle->Init.Mode);
    if (ret) {
        printf("invalid uart data \r\n");
        memset(pstuarthandle, 0, sizeof(*pstuarthandle));
        return -1;
    }    

    if(NULL == stm32_uart[uart->port].UartRxBuf){
        stm32_uart[uart->port].UartRxBuf = aos_malloc(uartIns->attr.max_buf_bytes);
    }
    
    if (NULL == stm32_uart[uart->port].UartRxBuf) {
        printf("Fail to malloc memory size %d at %s %d \r\d", uartIns->attr.max_buf_bytes, __FILE__, __LINE__);
        return -1;
    }
    memset(stm32_uart[uart->port].UartRxBuf, 0, uartIns->attr.max_buf_bytes);

    //uart->priv = pstuarthandle; //priv must not be used in uart driver

    pstuarthandle->Instance = (USART_TypeDef*)uartIns->uartPhyP;
    pstuarthandle->Init.OverSampling = uartIns->attr.overSampling;
    
    /* init uart */
    ret = HAL_UART_Init(pstuarthandle);
    if (ret != HAL_OK) {
        printf("uart %d init fail \r\n", uart->port);
        aos_free(stm32_uart[uart->port].UartRxBuf);
        stm32_uart[uart->port].UartRxBuf = NULL;
        return ret;
    }

