alibaba/AliOS-Things/platform/mcu/stm32f1xx/hal/hal_uart_stm32f1.c
                if(rx_count==expect_size)
                {
                    break;
                }
            }
        }
        else
        {
            break;
        }
    }

    if (recv_size != NULL)
    {
        *recv_size = rx_count;
    }

    if(rx_count != 0)
    {
        ret = 0;
    }
    else
    {
        ret = -1;
    }
    
    
    return ret;
}

static int32_t uart_receive_dma(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout)
{
    uint8_t *pdata = (uint8_t *)data;  
    uint32_t rx_count = 0;
    int32_t ret = -1;
    uint32_t cr1its = 0;
    uint32_t dmaisr = 0;
        
    UART_MAPPING* uartIns = GetUARTMapping(uart->port);

    while ( rx_count < expect_size )
    {
        while((stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in)||stm32_uart[uart->port].RxBuf_is_full)
        {
            stm32_uart[uart->port].RxBuf_is_full =0;
            pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];

            if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
            {
                stm32_uart[uart->port].uart_rx_out = 0;
            }
            
            if(rx_count==expect_size)
            {
                break;
            }
        }
        if(rx_count==expect_size)
        {
            break;
        }

        if(RHINO_SUCCESS==aos_sem_wait(&stm32_uart[uart->port].uart_rx_sem, timeout))
        {

            while(stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in)
            {
                pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];
                if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
                {
                    stm32_uart[uart->port].uart_rx_out = 0;
                }

                if(rx_count==expect_size)
                {
                    break;
                }
            }
        }
        else
        {
            break;
        }

        /* check DMA status
         * make sure DMA is active when buffer has space to receive new data
         * if(stm32_uart[uart->port].uart_dma_stop ==1)
         * EN bit in CR register will be cleared by hardware when a DMA end of transfer
         */
        cr1its = READ_REG(stm32_uart[uart->port].hal_uart_handle.hdmarx->Instance->CCR);
        if(cr1its & DMA_CCR_EN == RESET)
        {
            if((stm32_uart[uart->port].uart_rx_in==0 &&stm32_uart[uart->port].uart_rx_out>=(uartIns->attr.max_buf_bytes)/2)
                ||((stm32_uart[uart->port].uart_rx_in == (uartIns->attr.max_buf_bytes)/2 )&& (stm32_uart[uart->port].uart_rx_out <=(uartIns->attr.max_buf_bytes)/2))
            ||((stm32_uart[uart->port].uart_rx_in == stm32_uart[uart->port].uart_rx_out)&&!stm32_uart[uart->port].RxBuf_is_full))
            {
                if(HAL_UART_Receive_DMA(&(stm32_uart[uart->port].hal_uart_handle),(uint8_t*)&stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_in],(uartIns->attr.max_buf_bytes)/2)!= HAL_OK)
                {
                    Error_Handler(); 
                }
                    stm32_uart[uart->port].uart_dma_stop =0;
                    stm32_uart[uart->port].previous_dma_leftbyte = (uartIns->attr.max_buf_bytes)/2;
            }
        }

    }

    if (recv_size != NULL)
    {
        *recv_size = rx_count;
    }

    if(rx_count != 0)
    {
        ret = 0;
    }
    else
    {
        cr1its = READ_REG(stm32_uart[uart->port].hal_uart_handle.hdmarx->Instance->CCR);
        printf("uart_rx_in %d uart_rx_out %d RxBuf_is_full %d uart_dma_stop %d \r\n",
            stm32_uart[uart->port].uart_rx_in, stm32_uart[uart->port].uart_rx_out,
            stm32_uart[uart->port].RxBuf_is_full, stm32_uart[uart->port].uart_dma_stop);
        dmaisr = READ_REG(stm32_uart[uart->port].hal_uart_handle.hdmarx->DmaBaseAddress->ISR);
        printf("cr1its 0x%x dma1 isr 0x%x \r\n", cr1its, dmaisr);
        ret = -1;
    }

    return ret;
}

int32_t hal_uart_finalize(uart_dev_t *uart)
{
    int32_t ret = -1;
    UART_MAPPING* uartIns = NULL;
    
    if (uart == NULL) {
        return -1;
    }

    uartIns = GetUARTMapping(uart->port);
    if( NULL== uartIns ){ 
        return -1;
    }

    if (stm32_uart[uart->port].inited == 0) {
        return -1;
    }
    
    ret = HAL_UART_DeInit(&stm32_uart[uart->port].hal_uart_handle);
    if(NULL != stm32_uart[uart->port].UartRxBuf){
        free(stm32_uart[uart->port].UartRxBuf);
        stm32_uart[uart->port].UartRxBuf = NULL;
    }

    if (aos_sem_is_valid(&stm32_uart[uart->port].uart_tx_sem)) {
        aos_sem_free(&stm32_uart[uart->port].uart_tx_sem);
    }
    
    if (aos_mutex_is_valid(&stm32_uart[uart->port].uart_tx_mutex)) {
        aos_mutex_free(&stm32_uart[uart->port].uart_tx_mutex);
    }

    if (aos_sem_is_valid(&stm32_uart[uart->port].uart_rx_sem)) {
        aos_sem_free(&stm32_uart[uart->port].uart_rx_sem);
    }

    if (aos_mutex_is_valid(&stm32_uart[uart->port].uart_rx_mutex)) {
        aos_mutex_free(&stm32_uart[uart->port].uart_rx_mutex);
    }

    stm32_uart[uart->port].inited = 0;
    return ret;
}

int32_t uart_dataWidth_transform(hal_uart_data_width_t data_width_hal,
        uint32_t *data_width_stm32l4)
{
    uint32_t data_width = 0;
    int32_t ret = 0;

    if(data_width_hal == DATA_WIDTH_8BIT)
    {
        data_width = UART_WORDLENGTH_8B;
    }
    else if(data_width_hal == DATA_WIDTH_9BIT)
    {
        data_width = UART_WORDLENGTH_9B;
    }
    else
    {
        ret = -1;
    }

    if(ret == 0)
    {
        *data_width_stm32l4 = data_width;
    }

    return ret;
}

int32_t uart_parity_transform(hal_uart_parity_t parity_hal,
        uint32_t *parity_stm32l4)
{
    uint32_t parity = 0;
    int32_t ret = 0;

    if(parity_hal == NO_PARITY)
    {
        parity = UART_PARITY_NONE;
    }
    else if(parity_hal == ODD_PARITY)
    {
        parity = UART_PARITY_EVEN;
    }
    else if(parity_hal == EVEN_PARITY)
    {
        parity = UART_PARITY_ODD;
    }
    else
    {
        ret = -1;
    }

    if(ret == 0)
    {
        *parity_stm32l4 = parity;
    }

    return ret;
}

