alibaba/AliOS-Things/platform/mcu/stm32f1xx/hal/hal_uart_stm32f1.c
int32_t uart_stop_bits_transform(hal_uart_stop_bits_t stop_bits_hal,
        uint32_t *stop_bits_stm32l4)
{
    uint32_t stop_bits = 0;
    int32_t ret = 0;

    if(stop_bits_hal == STOP_BITS_1)
    {
        stop_bits = UART_STOPBITS_1;
    }
    else if(stop_bits_hal == STOP_BITS_2)
    {
        stop_bits = UART_STOPBITS_2;
    }
    else
    {
        ret = -1;
    }

    if(ret == 0)
    {
        *stop_bits_stm32l4 = stop_bits;
    }

    return ret;
}

int32_t uart_flow_control_transform(hal_uart_flow_control_t flow_control_hal,
        uint32_t *flow_control_stm32l4)
{
    uint32_t flow_control = 0;
    int32_t ret = 0;

    if(flow_control_hal == FLOW_CONTROL_DISABLED)
    {
        flow_control = UART_HWCONTROL_NONE;
    }
    else if(flow_control_hal == FLOW_CONTROL_CTS)
    {
        flow_control = UART_HWCONTROL_CTS;
    }
    else if(flow_control_hal == FLOW_CONTROL_RTS)
    {
        flow_control = UART_HWCONTROL_RTS;
    }
    else if(flow_control_hal == FLOW_CONTROL_RTS)
    {
        flow_control = UART_HWCONTROL_RTS_CTS;
    }
    else
    {
        ret = -1;
    }

    if(ret == 0)
    {
        *flow_control_stm32l4 = flow_control;
    }

    return ret;
}

int32_t uart_mode_transform(hal_uart_mode_t mode_hal, uint32_t *mode_stm32l4)
{
    uint32_t mode = 0;
    int32_t ret = 0;

    if(mode_hal == MODE_TX)
    {
        mode = UART_MODE_TX;
    }
    else if(mode_hal == MODE_RX)
    {
        mode = UART_MODE_RX;
    }
    else if(mode_hal == MODE_TX_RX)
    {
        mode = UART_MODE_TX_RX;
    }
    else
    {
        ret = -1;
    }

    if(ret == 0)
    {
        *mode_stm32l4 = mode;
    }

    return ret;
}

/**
  * @brief  Get UART Handler
  * @param  port Logical UART Port, e.g. STD UART is always 0
  * @retval UART Handler
  */
UART_HandleTypeDef * uart_get_handle(const uint8_t port)
{
    UART_HandleTypeDef *handle = NULL;

    if (port < PORT_UART_SIZE) {
        handle = &stm32_uart[port].hal_uart_handle;
    } else {
        handle = NULL;
    }

    return handle;
}

/**
  * @brief  Tx Transfer completed callback
  * @param  huart: UART handle. 
  * @note   This example shows a simple way to report end of DMA Tx transfer, and 
  *         you can add your own implementation. 
  * @retval None
  */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(huart->Instance);

    aos_sem_signal(&stm32_uart[appPort].uart_tx_sem);
}

/**
  * @brief  Rx Transfer completed callbacks. It will be called from UART_DMAReceiveCplt
  * @param  huart pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(huart->Instance);
    UART_MAPPING* uartIns = GetUARTMapping(appPort);

    //check if it is called from UART_DMAReceiveCplt
    if(stm32_uart[appPort].hal_uart_handle.hdmarx != NULL)
        UART_DMA_RxCpltCallback(appPort,uartIns->attr.max_buf_bytes);
    else
        UART_IT_RxCpltCallback(appPort,uartIns->attr.max_buf_bytes);
    aos_sem_signal(&stm32_uart[appPort].uart_rx_sem);
}

static void UART_IT_RxCpltCallback(PORT_UART_TYPE appPort, uint32_t max_buffer_size)
{

    //TODO:
    //should take care to avoid UART_RX_IN get accross UART_RX_OUT, which will loss unread data
    //if receive buffer is too small, or application read data out of receive buffer at very low frequence
    //this situation may happen
    if(++stm32_uart[appPort].uart_rx_in >= max_buffer_size)
        stm32_uart[appPort].uart_rx_in = 0;

    HAL_UART_Receive_IT(&stm32_uart[appPort].hal_uart_handle,(uint8_t*)&stm32_uart[appPort].UartRxBuf[stm32_uart[appPort].uart_rx_in],1);

}

static void UART_DMA_RxCpltCallback(PORT_UART_TYPE appPort, uint32_t max_buffer_size)
{
    UART_HandleTypeDef huart = stm32_uart[appPort].hal_uart_handle;
    //switch DMA Destination to another buffer region
    if(huart.hdmarx->Instance->CMAR == (uint32_t)&stm32_uart[appPort].UartRxBuf[0])
    {
        if(stm32_uart[appPort].uart_rx_out < max_buffer_size/2)
        {
            HAL_UART_Receive_DMA(&huart,(uint8_t*)&stm32_uart[appPort].UartRxBuf[max_buffer_size/2],max_buffer_size/2);
            stm32_uart[appPort].uart_dma_stop =0;
            stm32_uart[appPort].previous_dma_leftbyte = max_buffer_size/2;
        } else {
            stm32_uart[appPort].uart_dma_stop =1;
        }

        stm32_uart[appPort].uart_rx_in = (uint16_t)max_buffer_size/2;
        if(stm32_uart[appPort].uart_rx_in == stm32_uart[appPort].uart_rx_out)
            stm32_uart[appPort].RxBuf_is_full =1;
    } else {
        if(stm32_uart[appPort].uart_rx_out >= max_buffer_size/2)
        {
            HAL_UART_Receive_DMA(&huart,(uint8_t*)&stm32_uart[appPort].UartRxBuf[0],max_buffer_size/2);
            stm32_uart[appPort].uart_dma_stop =0;
            stm32_uart[appPort].uart_rx_in =0;
            stm32_uart[appPort].previous_dma_leftbyte = max_buffer_size/2;
        } else {
            stm32_uart[appPort].uart_dma_stop =1;
            stm32_uart[appPort].uart_rx_in = 0;//in case uart_rx_in = uart_rx_out, should take in account of "RxBuf_is_full" to identify if buffer is full
            if(stm32_uart[appPort].uart_rx_in == stm32_uart[appPort].uart_rx_out)
                stm32_uart[appPort].RxBuf_is_full =1;
        }
    }
}


/**
  * @brief  Rx IDLE callbacks.
  * @param  huart pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */

void HAL_UART_IdleCallback(UART_HandleTypeDef *huart)
{
    uint32_t left_byte;

    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(huart->Instance);
    UART_MAPPING* uartIns = GetUARTMapping(appPort);

    if(stm32_uart[appPort].uart_dma_stop) {
        if(stm32_uart[appPort].uart_error_count<0xffffffff)
            stm32_uart[appPort].uart_error_count++;
    } else {
        left_byte = READ_REG(huart->hdmarx->Instance->CNDTR);
        /* if left_byte=0, means DMA transfer complete interrupt maybe has happened
         * uart_rx_in will be update in DMA TC interrupt
         * don't do it repeatedly 
         */
        if(left_byte < stm32_uart[appPort].previous_dma_leftbyte && left_byte!=0)
        {
            stm32_uart[appPort].uart_rx_in += stm32_uart[appPort].previous_dma_leftbyte -left_byte;
            if(stm32_uart[appPort].uart_rx_in == uartIns->attr.max_buf_bytes)
                stm32_uart[appPort].uart_rx_in =0;
            stm32_uart[appPort].previous_dma_leftbyte = left_byte;
            if(stm32_uart[appPort].uart_rx_in == stm32_uart[appPort].uart_rx_out)
                stm32_uart[appPort].RxBuf_is_full =1;
        }
    }
    aos_sem_signal(&stm32_uart[appPort].uart_rx_sem);  

}

static void UartIdleHandler( const USART_TypeDef* ins)
{
    UART_HandleTypeDef* huart_handle;
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(ins);

    huart_handle = &(stm32_uart[appPort].hal_uart_handle);

    isrflags = READ_REG(huart_handle->Instance->SR);

    if(isrflags&USART_SR_IDLE)
    {
        //clear IDLE bit
        READ_REG(huart_handle->Instance->DR);
              
        HAL_UART_IdleCallback(huart_handle);
    }

}
#endif
